{
  "regions": [
    {
      "name": "Central America",
      "description": "Central American coffees are often known for their balanced qualities. They usually have a good balance of acidity and body, making them versatile and popular in the coffee world. Each country in the region brings its own unique flavors and characteristics.",
      "typicalFlavors": ["Chocolate", "Fruit", "Nuts", "Citrus"],
      "altitude": "1000-2000 meters",
      "processingMethods": ["Washed", "Natural", "Honey"],
      "countries": [
        {
          "name": "Guatemala",
          "description": "Guatemalan coffees are often full-bodied, rich, and with a complex taste profile.",
          "typicalFlavors": ["Chocolate", "Nuts", "Spices"],
          "altitude": "1300-1700 meters",
          "processingMethods": ["Washed", "Natural"]
        },
        {
          "name": "Honduras",
          "description": "Honduran coffees are known for their mild flavor profile and bright acidity.",
          "typicalFlavors": ["Fruit", "Caramel", "Nutty"],
          "altitude": "1000-2000 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "El Salvador",
          "description": "El Salvadorian coffees tend to have a medium body with sharp acidity.",
          "typicalFlavors": ["Citrus", "Sugar cane", "Nuts"],
          "altitude": "1200-1500 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Nicaragua",
          "description": "Nicaraguan coffees are typically medium-bodied with a balanced sweetness and acidity.",
          "typicalFlavors": ["Chocolate", "Fruit"],
          "altitude": "1000-1500 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Costa Rica",
          "description": "Costa Rican coffees are generally medium-bodied with bright acidity and prominent fruity flavors.",
          "typicalFlavors": ["Citrus", "Fruit", "Sugar cane"],
          "altitude": "1200-1700 meters",
          "processingMethods": ["Washed", "Honey"]
        },
        {
          "name": "Panama",
          "description": "Panama, especially the region of Boquete, is renowned for producing some of the most unique and high-quality coffees in the world. The country's coffee often exhibits bright acidity, medium body and complex flavors.",
          "typicalFlavors": ["Tropical Fruit", "Berries", "Cocoa"],
          "altitude": "1000-1800 meters",
          "processingMethods": ["Washed", "Natural"]
        }
      ]
    },
    {
      "name": "South America",
      "description": "South American coffees are renowned for their rich flavors, full-bodied texture, and a broad range of taste profiles. From the chocolaty sweetness of Colombian beans to the nutty richness of Brazilian ones, South America's diverse climates and landscapes contribute to the distinct qualities of its coffee.",
      "typicalFlavors": ["Chocolate", "Nuts", "Fruit", "Caramel"],
      "altitude": "800-2200 meters",
      "processingMethods": ["Washed", "Natural", "Pulped Natural"],
      "countries": [
        {
          "name": "Brazil",
          "description": "Brazilian coffees are known for their nutty and chocolatey flavors with a heavy body. They often have lower acidity and can exhibit sweet caramel notes. Brazil is the world's largest coffee producer.",
          "typicalFlavors": ["Chocolate", "Nuts", "Caramel"],
          "altitude": "800-1300 meters",
          "processingMethods": ["Natural", "Pulped Natural"]
        },
        {
          "name": "Colombia",
          "description": "Colombian coffees are often medium-bodied with a balanced acidity and dominant flavors of citrus, fruit, and berries. The country's diverse microclimates contribute to these unique flavor profiles.",
          "typicalFlavors": ["Citrus", "Fruit", "Berries"],
          "altitude": "1200-2000 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Peru",
          "description": "Peruvian coffees tend to have a medium to light body with bright acidity. They often exhibit floral and fruity notes along with some sweet caramel undertones.",
          "typicalFlavors": ["Fruit", "Floral", "Caramel"],
          "altitude": "1100-2200 meters",
          "processingMethods": ["Washed"]
        }
      ]
    },
    {
      "name": "Africa",
      "description": "African coffees are known for their bright acidity and fruity, wine-like flavors. They often have floral notes and a tea-like body. The birthplace of coffee, Ethiopia, is in Africa and it along with other African countries like Kenya and Tanzania produce some of the world's most distinctive coffees.",
      "typicalFlavors": ["Fruit", "Floral", "Wine-like", "Berries"],
      "altitude": "1200-2300 meters",
      "processingMethods": ["Washed", "Natural"],
      "countries": [
        {
          "name": "Rwanda",
          "description": "Rwandan coffee is often characterized by a bright acidity and complex flavors of fruit and floral notes. The high altitude of Rwanda's coffee-growing regions contributes to these unique qualities.",
          "typicalFlavors": ["Fruit", "Floral", "Tea-like"],
          "altitude": "1500-2000 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Uganda",
          "description": "Ugandan coffees often have a full body with low acidity. They exhibit flavors of chocolate and nuts along with some fruity undertones.",
          "typicalFlavors": ["Chocolate", "Nuts", "Fruit"],
          "altitude": "1200-1800 meters",
          "processingMethods": ["Natural"]
        },
        {
          "name": "Kenya",
          "description": "Kenyan coffees are known for their vibrant acidity and rich flavors. They often have a wine-like quality to them and can exhibit notes of berries and citrus.",
          "typicalFlavors": ["Berries", "Citrus", "Wine-like"],
          "altitude": "1500-2100 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Ethiopia",
          "description": "Ethiopian coffees are incredibly diverse in flavor due to the country's wide range of microclimates. They can range from winey to fruity or even tea-like with floral notes. Ethiopia is considered the birthplace of coffee.",
          "typicalFlavors": ["Fruit", "Wine-like", "Tea-like", "Floral"],
          "altitude": "1500-2200 meters",
          "processingMethods": ["Natural", "Washed"]
        },
        {
          "name": "Yemen",
          "description": "Yemeni coffees are known for their distinctive, winey richness and intense dried fruit flavors. The traditional 'natural' process used in Yemen contributes to these unique qualities.",
          "typicalFlavors": ["Dried Fruit", "Spice", "Wine-like"],
          "altitude": "800-1900 meters",
          "processingMethods": ["Natural"]
        }
      ]
    },
    {
      "name": "Asia",
      "description": "Asian coffees are often known for their full-bodied, earthy flavors and low acidity. They often exhibit notes of spices and herbs. Countries like Vietnam and Indonesia, including the famous Sumatra region, contribute significantly to the region's coffee production.",
      "typicalFlavors": ["Earthy", "Spices", "Herbs"],
      "altitude": "400-2000 meters",
      "processingMethods": ["Wet-Hulled", "Washed", "Natural"],
      "countries": [
        {
          "name": "India",
          "description": "Indian coffees often have a full body with medium acidity. They can exhibit spicy and nutty flavors, and some Indian coffees like Monsooned Malabar have unique processing methods that contribute to their distinct taste.",
          "typicalFlavors": ["Spices", "Nuts"],
          "altitude": "600-1600 meters",
          "processingMethods": ["Washed", "Monsooned"]
        },
        {
          "name": "Sumatra",
          "description": "Sumatran coffees are known for their full-bodied, earthy flavor with low acidity. They often exhibit notes of dark chocolate and spices. The wet-hulled process commonly used in Sumatra contributes to these unique qualities.",
          "typicalFlavors": ["Earthy", "Dark Chocolate", "Spices"],
          "altitude": "800-1500 meters",
          "processingMethods": ["Wet-Hulled"]
        },
        {
          "name": "Java",
          "description": "Java coffees are typically heavy bodied with a lasting finish. They can range from sweet and fruity to dark and spicy depending on the specific region within Java.",
          "typicalFlavors": ["Fruit", "Dark Chocolate", "Spices"],
          "altitude": "800-1600 meters",
          "processingMethods": ["Washed"]
        },
        {
          "name": "Papua New Guinea",
          "description": "Coffees from Papua New Guinea often have a medium body with bright acidity. They can exhibit fruity flavors along with some earthy undertones.",
          "typicalFlavors": ["Fruit", "Earthy"],
          "altitude": "1500-2100 meters",
          "processingMethods": ["Washed"]
        }
      ]
    }
  ]
}
